RIOT-OS/RIOT/cpu/cc26x0_cc13x0/vendor/inc/hw_aon_event.h
//*****************************************************************************
//
// Register: AON_EVENT_O_AUXWUSEL
//
//*****************************************************************************
// Field: [21:16] WU2_EV
//
// AUX Wakeup Source #2
//
// AON Event Source selecting 1 of 3 events routed to AON_WUC for waking up the
// AUX domain from Power Off or Power Down.
// Note:
// ENUMs:
// NONE                     No event, always low
// AUX_COMPB_ASYNC_N        Comparator B not triggered. Asynchronous signal
//                          directly from AUX Comparator B (inverted) as
//                          opposed to AUX_COMPB which is synchronized in
//                          AUX
// AUX_COMPB_ASYNC          Comparator B triggered. Asynchronous signal
//                          directly from the AUX Comparator B as opposed
//                          to AUX_COMPB which is synchronized in AUX
// BATMON_VOLT              BATMON voltage update event
// BATMON_TEMP              BATMON temperature update event
// AUX_TIMER1_EV            AUX Timer 1 Event
// AUX_TIMER0_EV            AUX Timer 0 Event
// AUX_TDC_DONE             TDC completed or timed out
// AUX_ADC_DONE             ADC conversion completed
// AUX_COMPB                Comparator B triggered
// AUX_COMPA                Comparator A triggered
// AUX_SWEV2                AUX Software triggered event #2. Triggered by
//                          AUX_EVCTL:SWEVSET.SWEV2
// AUX_SWEV1                AUX Software triggered event #1. Triggered by
//                          AUX_EVCTL:SWEVSET.SWEV1
// AUX_SWEV0                AUX Software triggered event #0. Triggered by
//                          AUX_EVCTL:SWEVSET.SWEV0
// JTAG                     JTAG generated event
// RTC_UPD                  RTC Update Tick (16 kHz signal, i.e. event line
//                          toggles value every 32 kHz clock period)
// RTC_COMB_DLY             RTC combined delayed event
// RTC_CH2_DLY              RTC channel 2 - delayed event
// RTC_CH1_DLY              RTC channel 1 - delayed event
// RTC_CH0_DLY              RTC channel 0 - delayed event
// RTC_CH2                  RTC channel 2 event
// RTC_CH1                  RTC channel 1 event
// RTC_CH0                  RTC channel 0 event
// PAD                      Edge detect on any PAD
// PAD31                    Edge detect on PAD31
// PAD30                    Edge detect on PAD30
// PAD29                    Edge detect on PAD29
// PAD28                    Edge detect on PAD28
// PAD27                    Edge detect on PAD27
// PAD26                    Edge detect on PAD26
// PAD25                    Edge detect on PAD25
// PAD24                    Edge detect on PAD24
// PAD23                    Edge detect on PAD23
// PAD22                    Edge detect on PAD22
// PAD21                    Edge detect on PAD21
// PAD20                    Edge detect on PAD20
// PAD19                    Edge detect on PAD19
// PAD18                    Edge detect on PAD18
// PAD17                    Edge detect on PAD17
// PAD16                    Edge detect on PAD16
// PAD15                    Edge detect on PAD15
// PAD14                    Edge detect on PAD14
// PAD13                    Edge detect on PAD13
// PAD12                    Edge detect on PAD12
// PAD11                    Edge detect on PAD11
// PAD10                    Edge detect on PAD10
// PAD9                     Edge detect on PAD9
// PAD8                     Edge detect on PAD8
// PAD7                     Edge detect on PAD7
// PAD6                     Edge detect on PAD6
// PAD5                     Edge detect on PAD5
// PAD4                     Edge detect on PAD4
// PAD3                     Edge detect on PAD3
// PAD2                     Edge detect on PAD2
// PAD1                     Edge detect on PAD1
// PAD0                     Edge detect on PAD0
#define AON_EVENT_AUXWUSEL_WU2_EV_W                                          6
#define AON_EVENT_AUXWUSEL_WU2_EV_M                                 0x003F0000
#define AON_EVENT_AUXWUSEL_WU2_EV_S                                         16
#define AON_EVENT_AUXWUSEL_WU2_EV_NONE                              0x003F0000
#define AON_EVENT_AUXWUSEL_WU2_EV_AUX_COMPB_ASYNC_N                 0x00380000
#define AON_EVENT_AUXWUSEL_WU2_EV_AUX_COMPB_ASYNC                   0x00370000
#define AON_EVENT_AUXWUSEL_WU2_EV_BATMON_VOLT                       0x00360000
#define AON_EVENT_AUXWUSEL_WU2_EV_BATMON_TEMP                       0x00350000
#define AON_EVENT_AUXWUSEL_WU2_EV_AUX_TIMER1_EV                     0x00340000
#define AON_EVENT_AUXWUSEL_WU2_EV_AUX_TIMER0_EV                     0x00330000
#define AON_EVENT_AUXWUSEL_WU2_EV_AUX_TDC_DONE                      0x00320000
#define AON_EVENT_AUXWUSEL_WU2_EV_AUX_ADC_DONE                      0x00310000
#define AON_EVENT_AUXWUSEL_WU2_EV_AUX_COMPB                         0x00300000
#define AON_EVENT_AUXWUSEL_WU2_EV_AUX_COMPA                         0x002F0000
#define AON_EVENT_AUXWUSEL_WU2_EV_AUX_SWEV2                         0x002E0000
#define AON_EVENT_AUXWUSEL_WU2_EV_AUX_SWEV1                         0x002D0000
#define AON_EVENT_AUXWUSEL_WU2_EV_AUX_SWEV0                         0x002C0000
#define AON_EVENT_AUXWUSEL_WU2_EV_JTAG                              0x002B0000
#define AON_EVENT_AUXWUSEL_WU2_EV_RTC_UPD                           0x002A0000
#define AON_EVENT_AUXWUSEL_WU2_EV_RTC_COMB_DLY                      0x00290000
#define AON_EVENT_AUXWUSEL_WU2_EV_RTC_CH2_DLY                       0x00280000
#define AON_EVENT_AUXWUSEL_WU2_EV_RTC_CH1_DLY                       0x00270000
#define AON_EVENT_AUXWUSEL_WU2_EV_RTC_CH0_DLY                       0x00260000
#define AON_EVENT_AUXWUSEL_WU2_EV_RTC_CH2                           0x00250000
#define AON_EVENT_AUXWUSEL_WU2_EV_RTC_CH1                           0x00240000
#define AON_EVENT_AUXWUSEL_WU2_EV_RTC_CH0                           0x00230000
#define AON_EVENT_AUXWUSEL_WU2_EV_PAD                               0x00200000
#define AON_EVENT_AUXWUSEL_WU2_EV_PAD31                             0x001F0000
#define AON_EVENT_AUXWUSEL_WU2_EV_PAD30                             0x001E0000
#define AON_EVENT_AUXWUSEL_WU2_EV_PAD29                             0x001D0000
#define AON_EVENT_AUXWUSEL_WU2_EV_PAD28                             0x001C0000
#define AON_EVENT_AUXWUSEL_WU2_EV_PAD27                             0x001B0000
#define AON_EVENT_AUXWUSEL_WU2_EV_PAD26                             0x001A0000
#define AON_EVENT_AUXWUSEL_WU2_EV_PAD25                             0x00190000
#define AON_EVENT_AUXWUSEL_WU2_EV_PAD24                             0x00180000
#define AON_EVENT_AUXWUSEL_WU2_EV_PAD23                             0x00170000
#define AON_EVENT_AUXWUSEL_WU2_EV_PAD22                             0x00160000
#define AON_EVENT_AUXWUSEL_WU2_EV_PAD21                             0x00150000
#define AON_EVENT_AUXWUSEL_WU2_EV_PAD20                             0x00140000
#define AON_EVENT_AUXWUSEL_WU2_EV_PAD19                             0x00130000
#define AON_EVENT_AUXWUSEL_WU2_EV_PAD18                             0x00120000
#define AON_EVENT_AUXWUSEL_WU2_EV_PAD17                             0x00110000
#define AON_EVENT_AUXWUSEL_WU2_EV_PAD16                             0x00100000
#define AON_EVENT_AUXWUSEL_WU2_EV_PAD15                             0x000F0000
#define AON_EVENT_AUXWUSEL_WU2_EV_PAD14                             0x000E0000
#define AON_EVENT_AUXWUSEL_WU2_EV_PAD13                             0x000D0000
#define AON_EVENT_AUXWUSEL_WU2_EV_PAD12                             0x000C0000
#define AON_EVENT_AUXWUSEL_WU2_EV_PAD11                             0x000B0000
#define AON_EVENT_AUXWUSEL_WU2_EV_PAD10                             0x000A0000
#define AON_EVENT_AUXWUSEL_WU2_EV_PAD9                              0x00090000
#define AON_EVENT_AUXWUSEL_WU2_EV_PAD8                              0x00080000
#define AON_EVENT_AUXWUSEL_WU2_EV_PAD7                              0x00070000
#define AON_EVENT_AUXWUSEL_WU2_EV_PAD6                              0x00060000
#define AON_EVENT_AUXWUSEL_WU2_EV_PAD5                              0x00050000
#define AON_EVENT_AUXWUSEL_WU2_EV_PAD4                              0x00040000
#define AON_EVENT_AUXWUSEL_WU2_EV_PAD3                              0x00030000
#define AON_EVENT_AUXWUSEL_WU2_EV_PAD2                              0x00020000
#define AON_EVENT_AUXWUSEL_WU2_EV_PAD1                              0x00010000
#define AON_EVENT_AUXWUSEL_WU2_EV_PAD0                              0x00000000

// Field:  [13:8] WU1_EV
//
// AUX Wakeup Source #1
//
// AON Event Source selecting 1 of 3 events routed to AON_WUC for waking up the
// AUX domain from Power Off or Power Down.
// Note:
// ENUMs:
// NONE                     No event, always low
// AUX_COMPB_ASYNC_N        Comparator B not triggered. Asynchronous signal
//                          directly from AUX Comparator B (inverted) as
//                          opposed to AUX_COMPB which is synchronized in
//                          AUX
// AUX_COMPB_ASYNC          Comparator B triggered. Asynchronous signal
//                          directly from the AUX Comparator B as opposed
//                          to AUX_COMPB which is synchronized in AUX
// BATMON_VOLT              BATMON voltage update event
// BATMON_TEMP              BATMON temperature update event
// AUX_TIMER1_EV            AUX Timer 1 Event
// AUX_TIMER0_EV            AUX Timer 0 Event
// AUX_TDC_DONE             TDC completed or timed out
// AUX_ADC_DONE             ADC conversion completed
// AUX_COMPB                Comparator B triggered
// AUX_COMPA                Comparator A triggered
// AUX_SWEV2                AUX Software triggered event #2. Triggered by
//                          AUX_EVCTL:SWEVSET.SWEV2
// AUX_SWEV1                AUX Software triggered event #1. Triggered by
//                          AUX_EVCTL:SWEVSET.SWEV1
// AUX_SWEV0                AUX Software triggered event #0. Triggered by
//                          AUX_EVCTL:SWEVSET.SWEV0
// JTAG                     JTAG generated event
// RTC_UPD                  RTC Update Tick (16 kHz signal, i.e. event line
//                          toggles value every 32 kHz clock period)
// RTC_COMB_DLY             RTC combined delayed event
// RTC_CH2_DLY              RTC channel 2 - delayed event
// RTC_CH1_DLY              RTC channel 1 - delayed event
// RTC_CH0_DLY              RTC channel 0 - delayed event
// RTC_CH2                  RTC channel 2 event
// RTC_CH1                  RTC channel 1 event
// RTC_CH0                  RTC channel 0 event
// PAD                      Edge detect on any PAD
// PAD31                    Edge detect on PAD31
// PAD30                    Edge detect on PAD30
// PAD29                    Edge detect on PAD29
// PAD28                    Edge detect on PAD28
// PAD27                    Edge detect on PAD27
// PAD26                    Edge detect on PAD26
// PAD25                    Edge detect on PAD25
// PAD24                    Edge detect on PAD24
// PAD23                    Edge detect on PAD23
// PAD22                    Edge detect on PAD22
// PAD21                    Edge detect on PAD21
// PAD20                    Edge detect on PAD20
// PAD19                    Edge detect on PAD19
// PAD18                    Edge detect on PAD18
// PAD17                    Edge detect on PAD17
// PAD16                    Edge detect on PAD16
// PAD15                    Edge detect on PAD15
// PAD14                    Edge detect on PAD14
// PAD13                    Edge detect on PAD13
// PAD12                    Edge detect on PAD12
// PAD11                    Edge detect on PAD11
// PAD10                    Edge detect on PAD10
// PAD9                     Edge detect on PAD9
// PAD8                     Edge detect on PAD8
// PAD7                     Edge detect on PAD7
// PAD6                     Edge detect on PAD6
// PAD5                     Edge detect on PAD5
// PAD4                     Edge detect on PAD4
// PAD3                     Edge detect on PAD3
// PAD2                     Edge detect on PAD2
// PAD1                     Edge detect on PAD1
// PAD0                     Edge detect on PAD0
#define AON_EVENT_AUXWUSEL_WU1_EV_W                                          6
#define AON_EVENT_AUXWUSEL_WU1_EV_M                                 0x00003F00
#define AON_EVENT_AUXWUSEL_WU1_EV_S                                          8
#define AON_EVENT_AUXWUSEL_WU1_EV_NONE                              0x00003F00
#define AON_EVENT_AUXWUSEL_WU1_EV_AUX_COMPB_ASYNC_N                 0x00003800
#define AON_EVENT_AUXWUSEL_WU1_EV_AUX_COMPB_ASYNC                   0x00003700
#define AON_EVENT_AUXWUSEL_WU1_EV_BATMON_VOLT                       0x00003600
#define AON_EVENT_AUXWUSEL_WU1_EV_BATMON_TEMP                       0x00003500
#define AON_EVENT_AUXWUSEL_WU1_EV_AUX_TIMER1_EV                     0x00003400
#define AON_EVENT_AUXWUSEL_WU1_EV_AUX_TIMER0_EV                     0x00003300
#define AON_EVENT_AUXWUSEL_WU1_EV_AUX_TDC_DONE                      0x00003200
#define AON_EVENT_AUXWUSEL_WU1_EV_AUX_ADC_DONE                      0x00003100
#define AON_EVENT_AUXWUSEL_WU1_EV_AUX_COMPB                         0x00003000
#define AON_EVENT_AUXWUSEL_WU1_EV_AUX_COMPA                         0x00002F00
#define AON_EVENT_AUXWUSEL_WU1_EV_AUX_SWEV2                         0x00002E00
#define AON_EVENT_AUXWUSEL_WU1_EV_AUX_SWEV1                         0x00002D00
#define AON_EVENT_AUXWUSEL_WU1_EV_AUX_SWEV0                         0x00002C00
#define AON_EVENT_AUXWUSEL_WU1_EV_JTAG                              0x00002B00
#define AON_EVENT_AUXWUSEL_WU1_EV_RTC_UPD                           0x00002A00
#define AON_EVENT_AUXWUSEL_WU1_EV_RTC_COMB_DLY                      0x00002900
#define AON_EVENT_AUXWUSEL_WU1_EV_RTC_CH2_DLY                       0x00002800
#define AON_EVENT_AUXWUSEL_WU1_EV_RTC_CH1_DLY                       0x00002700
#define AON_EVENT_AUXWUSEL_WU1_EV_RTC_CH0_DLY                       0x00002600
#define AON_EVENT_AUXWUSEL_WU1_EV_RTC_CH2                           0x00002500
#define AON_EVENT_AUXWUSEL_WU1_EV_RTC_CH1                           0x00002400
#define AON_EVENT_AUXWUSEL_WU1_EV_RTC_CH0                           0x00002300
#define AON_EVENT_AUXWUSEL_WU1_EV_PAD                               0x00002000
#define AON_EVENT_AUXWUSEL_WU1_EV_PAD31                             0x00001F00
#define AON_EVENT_AUXWUSEL_WU1_EV_PAD30                             0x00001E00
#define AON_EVENT_AUXWUSEL_WU1_EV_PAD29                             0x00001D00
#define AON_EVENT_AUXWUSEL_WU1_EV_PAD28                             0x00001C00
#define AON_EVENT_AUXWUSEL_WU1_EV_PAD27                             0x00001B00
#define AON_EVENT_AUXWUSEL_WU1_EV_PAD26                             0x00001A00
#define AON_EVENT_AUXWUSEL_WU1_EV_PAD25                             0x00001900
#define AON_EVENT_AUXWUSEL_WU1_EV_PAD24                             0x00001800
#define AON_EVENT_AUXWUSEL_WU1_EV_PAD23                             0x00001700
#define AON_EVENT_AUXWUSEL_WU1_EV_PAD22                             0x00001600
#define AON_EVENT_AUXWUSEL_WU1_EV_PAD21                             0x00001500
#define AON_EVENT_AUXWUSEL_WU1_EV_PAD20                             0x00001400
#define AON_EVENT_AUXWUSEL_WU1_EV_PAD19                             0x00001300
#define AON_EVENT_AUXWUSEL_WU1_EV_PAD18                             0x00001200
#define AON_EVENT_AUXWUSEL_WU1_EV_PAD17                             0x00001100
#define AON_EVENT_AUXWUSEL_WU1_EV_PAD16                             0x00001000
#define AON_EVENT_AUXWUSEL_WU1_EV_PAD15                             0x00000F00
#define AON_EVENT_AUXWUSEL_WU1_EV_PAD14                             0x00000E00
#define AON_EVENT_AUXWUSEL_WU1_EV_PAD13                             0x00000D00
#define AON_EVENT_AUXWUSEL_WU1_EV_PAD12                             0x00000C00
#define AON_EVENT_AUXWUSEL_WU1_EV_PAD11                             0x00000B00
#define AON_EVENT_AUXWUSEL_WU1_EV_PAD10                             0x00000A00
#define AON_EVENT_AUXWUSEL_WU1_EV_PAD9                              0x00000900
#define AON_EVENT_AUXWUSEL_WU1_EV_PAD8                              0x00000800
#define AON_EVENT_AUXWUSEL_WU1_EV_PAD7                              0x00000700
#define AON_EVENT_AUXWUSEL_WU1_EV_PAD6                              0x00000600
#define AON_EVENT_AUXWUSEL_WU1_EV_PAD5                              0x00000500
#define AON_EVENT_AUXWUSEL_WU1_EV_PAD4                              0x00000400
#define AON_EVENT_AUXWUSEL_WU1_EV_PAD3                              0x00000300
#define AON_EVENT_AUXWUSEL_WU1_EV_PAD2                              0x00000200
#define AON_EVENT_AUXWUSEL_WU1_EV_PAD1                              0x00000100
#define AON_EVENT_AUXWUSEL_WU1_EV_PAD0                              0x00000000

